function Dsy() {
    this.Items = {};
}
Dsy.prototype.add = function (id, iArray) {
    this.Items[id] = iArray;
}
Dsy.prototype.Exists = function (id) {
    if (typeof(this.Items[id]) == "undefined") return false;
    return true;
}

function change_cl(v) {
    var str = "0";
    for (i = 0; i < v; i++) { str += ("_" + (document.getElementById(cl[i]).selectedIndex - 1));}

    var ss = document.getElementById(cl[v]);
    with (ss) {
        length = 0;
        options[0] = new Option(opt_cl[v], opt_cl[v]);
        if (v && document.getElementById(cl[v - 1]).selectedIndex > 0 || !v) {
            if (dsy_cl.Exists(str)) {
                ar = dsy_cl.Items[str];
                for (i = 0; i < ar.length; i++)options[length] = new Option(ar[i], ar[i]);
                if (v)options[0].selected = true;
            }
        }
        if (++v < cl.length) {change_cl(v);}
    }
}
function preselect_cl(p_key) {
    //alert(p_key);
    var index;

    var provinces = new Array("农、林、牧、渔业", "采矿业","制造业");
    var cnt = provinces.length;
    //alert(cnt);
    for (i = 0; i < cnt; i++) {
        if (p_key == provinces[i]) {
            index = i;
            break;
        }
    }
    if (index < provinces.length) {
        document.getElementById(cl[0]).selectedIndex = index + 1;
        change_cl(1);
    }
}

var dsy_cl = new Dsy();
dsy_cl.add("0_0", ["农业", "林业", "畜牧业","渔业","农、林、牧、渔服务业"]);
dsy_cl.add("0_0_0", ["谷物及其他作物的种植", "蔬菜、园艺作物的种植", "水果、坚果、饮料和香料作物的种植", "中药材的种植"]);
dsy_cl.add("0_0_0_0",["谷物的种植","薯类的种植","油料的种植","豆类的种植","棉花的种植","麻类的种植","糖料的种植","烟草的种植","其他作物的种植"]);
dsy_cl.add("0_0_0_1", ["蔬菜的种植", "花卉的种植", "其他园艺作物的种植"]);
dsy_cl.add("0_0_0_2", ["水果、坚果的种植","茶及其他饮料作物的种植","香料作物的种植"]);
dsy_cl.add("0_0_1", ["林木的培育和种植", "木材和竹材的采运", "林产品的采集"]);
dsy_cl.add("0_0_1_0",["育种和育苗","造林","林木的抚育和管理"]);
dsy_cl.add("0_0_1_1",["木材的采运","竹材的采运"]);
dsy_cl.add("0_0_2", ["牲畜的饲养","猪的饲养","家禽的饲养","狩猎和捕捉动物","其他畜牧业"]);
dsy_cl.add("0_0_3", ["海洋渔业","内陆渔业"]);
dsy_cl.add("0_0_3_0",["海水养殖","海洋捕捞"]);
dsy_cl.add("0_0_3_1",["内陆养殖","内陆捕捞"]);
dsy_cl.add("0_0_4", ["农业服务业","林业服务业","畜牧服务业","渔业服务业"]);
dsy_cl.add("0_0_4_0",["灌溉服务","农产品初加工服务","其他农业服务"]);
dsy_cl.add("0_0_4_2",["兽医服务","其他畜牧服务"]);

dsy_cl.add("0_1", ["煤炭开采和洗选业", "石油和天然气开采业","黑色金属矿采选业","有色金属矿采选业","非金属矿采选业","其他采矿业"]);
dsy_cl.add("0_1_0", ["烟煤和无烟煤的开采洗选","褐煤的开采洗选", "其他煤炭采选"]);
dsy_cl.add("0_1_1", ["天然原油和天然气开采", "与石油和天然气开采有关的服务活动"]);
dsy_cl.add("0_1_2", ["铁矿采选","其他黑色金属矿采选"]);
dsy_cl.add("0_1_3", ["常用有色金属矿采选","贵金属矿采选","稀有稀土金属矿采选"]);
dsy_cl.add("0_1_3_0", ["铜矿采选","铅锌矿采选","镍钴矿采选","锡矿采选","锑矿采选","铝矿采选","镁矿采选","其他常用有色金属矿采选"]);
dsy_cl.add("0_1_3_1", ["金矿采选","银矿采选","其他贵金属矿采选"]);
dsy_cl.add("0_1_3_2", ["钨钼矿采选","稀土金属矿采选","放射性金属矿采选","其他稀有金属矿采选"]);
dsy_cl.add("0_1_4", ["土砂石开采","化学矿采选","采盐","石棉及其他非金属矿采选"]);
dsy_cl.add("0_1_4_0", ["石灰石、石膏开采","建筑装饰用石开采","耐火土石开采","粘土及其他土砂石开采"]);
dsy_cl.add("0_1_4_3", ["石棉、云母矿采选","石墨、滑石采选","宝石、玉石开采","其他非金属矿采选"]);

dsy_cl.add("0_2", ["农副食品加工业","食品制造业","饮料制造业","烟草制品业","纺织业","纺织服装、鞋、帽制造业","皮革、毛皮、羽毛(绒)及其制品业","木材加工及木、竹、藤、棕、草制品业","家具制造业","造纸及纸制品业","印刷业和记录媒介的复制","文教体育用品制造业","石油加工、炼焦及核燃料加工业","化学原料及化学制品制造业","医药制造业","化学纤维制造业","橡胶制品业","塑料制品业","非金属矿物制品业","黑色金属冶炼及压延加工业","有色金属冶炼及压延加工业","金属制品业","通用设备制造业","专用设备制造业","交通运输设备制造业","电气机械及器材制造业","通信设备、计算机及其他电子设备制造业","仪器仪表及文化、办公用机械制造业","工艺品及其他制造业","废弃资源和废旧材料回收加工业"]);
dsy_cl.add("0_2_0", ["谷物磨制","饲料加工","植物油加工","制糖","屠宰及肉类加工","水产品加工","蔬菜、水果和坚果加工","其他农副食品加工"])
    dsy_cl.add("0_2_0_2", ["食用植物油加工","非食用植物油加工"]);
dsy_cl.add("0_2_0_4", ["畜禽屠宰","肉制品及副产品加工"]);
    dsy_cl.add("0_2_0_5", ["水产品冷冻加工","鱼糜制品及水产品干腌制加工","水产饲料制造","鱼油提取及制品的制","其他水产品加工"]);
    dsy_cl.add("0_2_0_8", ["淀粉及淀粉制品的制造","豆制品制造","蛋品加工","其他未列明的农副食品加工"]);
    dsy_cl.add("0_2_1", ["焙烤食品制造","糖果、巧克力及蜜饯制造","方便食品制造","液体乳及乳制品制造","罐头制造","调味品、发酵制品制造","其他食品制造"]);
dsy_cl.add("0_2_1_0", ["糕点、面包制造","饼干及其他焙烤食品制造"]);
    dsy_cl.add("0_2_1_1", ["糖果、巧克力制造","蜜饯制作"]);
    dsy_cl.add("0_2_1_2", ["米、面制品制造","速冻食品制造","方便面及其他方便食品制造"]);
    dsy_cl.add("0_2_1_4", ["肉、禽类罐头制造","水产品罐头制造","蔬菜、水果罐头制造","其他罐头食品制造"]);
    dsy_cl.add("0_2_1_5", ["味精制造","酱油、食醋及类似制品的制造","其他调味品、发酵制品制造"]);
    dsy_cl.add("0_2_1_6", ["营养、保健食品制造","冷冻饮品及食用冰制造","盐加工","食品及饲料添加剂制造","其他未列明的食品制造"]);
    dsy_cl.add("0_2_2", ["酒精制造","酒的制造","软饮料制造","精制茶加工"]);
    dsy_cl.add("0_2_2_1", ["白酒制造","啤酒制造","黄酒制造","葡萄酒制造","其他酒制造"]);
    dsy_cl.add("0_2_2_2", ["碳酸饮料制造","瓶(罐)装饮用水制造","果菜汁及果菜汁饮料制造","含乳饮料和植物蛋白饮料制造","固体饮料制造","茶饮料及其他软饮料制造"]);

    dsy_cl.add("0_2_3", ["烟叶复烤","卷烟制造","其他烟草制品加工"]);
dsy_cl.add("0_2_4", ["棉、化纤纺织及印染精加工","毛纺织和染整精加工","麻纺织","丝绢纺织及精加工","纺织制成品制造","针织品、编织品及其制品制造"]);
dsy_cl.add("0_2_4_0", ["棉、化纤纺织加工","棉、化纤印染精加工"]);
dsy_cl.add("0_2_4_1", ["毛条加工","毛纺织","毛染整精加工"]);
dsy_cl.add("0_2_4_3", ["缫丝加工","绢纺和丝织加工","丝印染精加工"]);
dsy_cl.add("0_2_4_4", ["棉及化纤制品制造","毛制品制造","麻制品制造","丝制品制造","绳、索、缆的制造","纺织带和帘子布制造","无纺布制造","其他纺织制成品制造"]);
dsy_cl.add("0_2_4_5", ["棉、化纤针织品及编织品制造","毛针织品及编织品制造","丝针织品及编织品制造","其他针织品及编织品制造"]);
dsy_cl.add("0_2_5", ["纺织服装制造","纺织面料鞋的制造","制帽"]);
dsy_cl.add("0_2_6", ["皮革鞣制加工","皮革制品制造","毛皮鞣制及制品加工","羽毛(绒)加工及制品制造"]);
dsy_cl.add("0_2_6_1", ["皮鞋制造","皮革服装制造","皮箱、包(袋)制造","皮手套及皮装饰制品制造","其他皮革制品制造"]);
dsy_cl.add("0_2_6_2", ["毛皮鞣制加工","毛皮服装加工","其他毛皮制品加工"]);
dsy_cl.add("0_2_6_3", ["羽毛(绒)加工","羽毛(绒)制品加工"]);
dsy_cl.add("0_2_7", ["锯材、木片加工","人造板制造","木制品制造","竹、藤、棕、草制品制造"]);
dsy_cl.add("0_2_7_0", ["锯材加工","木片加工"]);
dsy_cl.add("0_2_7_1", ["胶合板制造","纤维板制造","刨花板制造","其他人造板、材制造"]);
dsy_cl.add("0_2_7_2", ["建筑用木料及木材组件加工","木容器制造","软木制品及其他木制品制造"]);
dsy_cl.add("0_2_8", ["木质家具制造","竹、藤家具制造","金属家具制造","塑料家具制造","其他家具制造"]);
dsy_cl.add("0_2_9", ["纸浆制造","造纸","纸制品制造"]);
dsy_cl.add("0_2_9_1", ["机制纸及纸板制造","手工纸制造","加工纸制造"]);
dsy_cl.add("0_2_9_2", ["纸和纸板容器的制造","其他纸制品制造"]);
dsy_cl.add("0_2_10", ["印刷","装订及其他印刷服务活动","记录媒介的复制"]);
dsy_cl.add("0_2_10_0", ["书、报、刊印刷","本册印制","包装装潢及其他印刷"]);
dsy_cl.add("0_2_11", ["文化用品制造","体育用品制造","乐器制造","玩具制造","游艺器材及娱乐用品制造"]);
dsy_cl.add("0_2_11_0", ["文具制造","笔的制造","教学用模型及教具制造","墨水、墨汁制造","其他文化用品制造"]);
dsy_cl.add("0_2_11_1", ["球类制造","体育器材及配件制造","训练健身器材制造","运动防护用具制造","其他体育用品制造"]);
dsy_cl.add("0_2_11_2", ["中乐器制造","西乐器制造","电子乐器制造","其他乐器及零件制造"]);
dsy_cl.add("0_2_11_4", ["露天游乐场所游乐设备制造","游艺用品及室内游艺器材制造"]);
dsy_cl.add("0_2_12", ["精炼石油产品的制造","炼焦","核燃料加工"]);
dsy_cl.add("0_2_12_0", ["原油加工及石油制品制造","人造原油生产"]);
dsy_cl.add("0_2_13", ["基础化学原料制造","肥料制造","农药制造","涂料、油墨、颜料及类似产品制造","合成材料制造","专用化学产品制造","日用化学产品制造"]);
dsy_cl.add("0_2_13_0", ["无机酸制造","无机碱制造","无机盐制造","有机化学原料制造","其他基础化学原料制造"]);
dsy_cl.add("0_2_13_1", ["氮肥制造","磷肥制造","钾肥制造","复混肥料制造","有机肥料及微生物肥料制造","其他肥料制造"]);
dsy_cl.add("0_2_13_2", ["化学农药制造","生物化学农药及微生物农药制造"]);
dsy_cl.add("0_2_13_3", ["涂料制造","油墨及类似产品制造","颜料制造","染料制造","密封用填料及类似品制造"]);
dsy_cl.add("0_2_13_4", ["初级形态的塑料及合成树脂制造","合成橡胶制造","合成纤维单(聚合)体的制造","其他合成材料制造"]);
dsy_cl.add("0_2_13_5", ["化学试剂和助剂制造","专项化学用品制造","林产化学产品制造","炸药及火工产品制造","信息化学品制造","环境污染处理专用药剂材料制造","动物胶制造","其他专用化学产品制造"]);
dsy_cl.add("0_2_13_6", ["肥皂及合成洗涤剂制造","化妆品制造","口腔清洁用品制造","香料、香精制造","其他日用化学产品制造"]);
dsy_cl.add("0_2_14", ["化学药品原药制造","化学药品制剂制造","中药饮片加工","中成药制造","兽用药品制造","生物、生化制品的制造","卫生材料及医药用品制造"]);
dsy_cl.add("0_2_15", ["纤维素纤维原料及纤维制造","合成纤维制造"]);
dsy_cl.add("0_2_15_0", ["化纤浆粕制造","人造纤维(纤维素纤维)制造"]);
dsy_cl.add("0_2_15_1", ["锦纶纤维制造","涤纶纤维制造","腈纶纤维制造","维纶纤维制造","其他合成纤维制造"]);
dsy_cl.add("0_2_16", ["轮胎制造","橡胶板、管、带的制造","橡胶零件制造","再生橡胶制造","日用及医用橡胶制品制造","橡胶靴鞋制造","其他橡胶制品制造"]);
dsy_cl.add("0_2_16_0", ["车辆、飞机及工程机械轮胎制造","力车胎制造","轮胎翻新加工"]);
dsy_cl.add("0_2_17", ["塑料薄膜制造","塑料板、管、型材的制造","塑料丝、绳及编织品的制造","泡沫塑料制造","塑料人造革、合成革制造","塑料包装箱及容器制造","塑料零件制造","日用塑料制造","其他塑料制品制造"]);
dsy_cl.add("0_2_17_7", ["塑料鞋制造","日用塑料杂品制造"]);
dsy_cl.add("0_2_18", ["水泥、石灰和石膏的制造","水泥及石膏制品制造","砖瓦、石材及其他建筑材料制造","玻璃及玻璃制品制造","陶瓷制品制造","耐火材料制品制造","石墨及其他非金属矿物制品制造"]);
dsy_cl.add("0_2_18_0", ["水泥制造","石灰和石膏制造"]);
dsy_cl.add("0_2_18_1", ["水泥制品制造","砼结构构件制造","石棉水泥制品制造","轻质建筑材料制造","其他水泥制品制造"]);
dsy_cl.add("0_2_18_2", ["粘土砖瓦及建筑砌块制造","建筑陶瓷制品制造","建筑用石加工","防水建筑材料制造","隔热和隔音材料制造","其他建筑材料制造"]);
dsy_cl.add("0_2_18_3", ["平板玻璃制造","技术玻璃制品制造","光学玻璃制造","玻璃仪器制造","日用玻璃制品及玻璃包装容器制造","玻璃保温容器制造","玻璃纤维及制品制造","玻璃纤维增强塑料制品制造","其他玻璃制品制造"]);
dsy_cl.add("0_2_18_4", ["卫生陶瓷制品制造","特种陶瓷制品制造","日用陶瓷制品制造","园林、陈设艺术及其他陶瓷制品制造"]);
dsy_cl.add("0_2_18_5", ["石棉制品制造","云母制品制造","耐火陶瓷制品及其他耐火材料制造"]);
dsy_cl.add("0_2_18_6", ["石墨及碳素制品制造","其他非金属矿物制品制造"]);
dsy_cl.add("0_2_19", ["炼铁","炼钢","钢压延加工","铁合金冶炼"]);
dsy_cl.add("0_2_20", ["常用有色金属冶炼","贵金属冶炼","稀有稀土金属冶炼","有色金属合金制造","有色金属压延加工"]);
dsy_cl.add("0_2_20_0", ["铜冶炼","铅锌冶炼","镍钴冶炼","锡冶炼","锑冶炼","铝冶炼","镁冶炼","其他常用有色金属冶炼"]);
dsy_cl.add("0_2_20_1", ["金冶炼","银冶炼","其他贵金属冶炼"]);
dsy_cl.add("0_2_20_2", ["钨钼冶炼","稀土金属冶炼","其他稀有金属冶炼"]);
dsy_cl.add("0_2_20_4", ["常用有色金属压延加工","贵金属压延加工","稀有稀土金属压延加工"]);
dsy_cl.add("0_2_21", ["结构性金属制品制造","金属工具制造","集装箱及金属包装容器制造","金属丝绳及其制品的制造","建筑、安全用金属制品制造","金属表面处理及热处理加工","搪瓷制品制造","不锈钢及类似日用金属制品制造","其他金属制品制造"]);
dsy_cl.add("0_2_21_0", ["金属结构制造","金属门窗制造"]);
dsy_cl.add("0_2_21_1", ["切削工具制造","手工具制造","农用及园林用金属工具制造","刀剪及类似日用金属工具制造","其他金属工具制造"]);
dsy_cl.add("0_2_21_2", ["集装箱制造","金属压力容器制造","金属包装容器制造"]);
dsy_cl.add("0_2_21_4", ["建筑、家具用金属配件制造","建筑装饰及水暖管道零件制造","安全、消防用金属制品制造","其他建筑、安全用金属制品制造"]);
dsy_cl.add("0_2_21_6", ["工业生产配套用搪瓷制品制造","搪瓷卫生洁具制造","搪瓷日用品及其他搪瓷制品制造"]);
dsy_cl.add("0_2_21_7", ["金属制厨房调理及卫生器具制造","金属制厨用器皿及餐具制造","其他日用金属制品制造"]);
dsy_cl.add("0_2_21_8", ["铸币及贵金属制实验室用品制造","其他未列明的金属制品制造"]);
dsy_cl.add("0_2_22", ["锅炉及原动机制造","金属加工机械制造","起重运输设备制造","泵、阀门、压缩机及类似机械的制造","轴承、齿轮、传动和驱动部件的制造","烘炉、熔炉及电炉制造","风机、衡器、包装设备等通用设备制造","通用零部件制造及机械修理","金属铸、锻加工"]);
dsy_cl.add("0_2_22_0", ["锅炉及辅助设备制造","内燃机及配件制造","汽轮机及辅机制造","水轮机及辅机制造","其他原动机制造"]);
dsy_cl.add("0_2_22_1", ["金属切削机床制造","金属成形机床制造","铸造机械制造","金属切割及焊接设备制造","机床附件制造","其他金属加工机械制造"]);
dsy_cl.add("0_2_22_3", ["泵及真空设备制造","气体压缩机械制造","阀门和旋塞的制造","液压和气压动力机械及元件制造"]);
dsy_cl.add("0_2_22_4", ["轴承制造","齿轮、传动和驱动部件制造"]);
dsy_cl.add("0_2_22_6", ["风机、风扇制造","气体、液体分离及纯净设备制造","制冷、空调设备制造","风动和电动工具制造","喷枪及类似器具制造","包装专用设备制造","衡器制造","其他通用设备制造"]);
dsy_cl.add("0_2_22_7", ["金属密封件制造","紧固件、弹簧制造","机械零部件加工及设备修理","其他通用零部件制造"]);
dsy_cl.add("0_2_22_8", ["钢铁铸件制造","锻件及粉末冶金制品制造"]);
dsy_cl.add("0_2_23", ["矿山、冶金、建筑专用设备制造","化工、木材、非金属加工专用设备制造","食品、饮料、烟草及饲料生产专用设备制造","印刷、制药、日化生产专用设备制造","纺织、服装和皮革工业专用设备制造","电子和电工机械专用设备制造","?农、林、牧、渔专用机械制造","医疗仪器设备及器械制造","环保、社会公共安全及其他专用设备制造"]);
dsy_cl.add("0_2_23_0", ["采矿、采石设备制造","石油钻采专用设备制造","建筑工程用机械制造","建筑材料生产专用机械制造","冶金专用设备制造"]);
dsy_cl.add("0_2_23_1", ["炼油、化工生产专用设备制造","橡胶加工专用设备制造","塑料加工专用设备制造","木材加工机械制造","模具制造","其他非金属加工专用设备制造"]);
dsy_cl.add("0_2_23_2", ["食品、饮料、烟草工业专用设备制造","农副食品加工专用设备制造","饲料生产专用设备制造"]);
dsy_cl.add("0_2_23_3", ["制浆和造纸专用设备制造","印刷专用设备制造","日用化工专用设备制造","制药专用设备制造","照明器具生产专用设备制造","玻璃、陶瓷和搪瓷制品生产专用设备制造","其他日用品生产专用设备制造"]);
dsy_cl.add("0_2_23_4", ["纺织专用设备制造","皮革、毛皮及其制品加工专用设备制造","缝纫机械制造","其他服装加工专用设备制造"]);
dsy_cl.add("0_2_23_5", ["电工机械专用设备制造","电子工业专用设备制造","武器弹药制造","航空、航天及其他专用设备制造"]);
dsy_cl.add("0_2_23_6", ["拖拉机制造","机械化农业及园艺机具制造","营林及木竹采伐机械制造","畜牧机械制造","渔业机械制造","农林牧渔机械配件制造","其他农林牧渔业机械制造及机械修理"]);
dsy_cl.add("0_2_23_7", ["医疗诊断、监护及治疗设备制造","口腔科用设备及器具制造","实验室及医用消毒设备和器具的制造","医疗、外科及兽医用器械制造","机械治疗及病房护理设备制造","假肢、人工器官及植(介)入器械制造","其他医疗设备及器械制造"]);
dsy_cl.add("0_2_23_8", ["环境污染防治专用设备制造","地质勘查专用设备制造","邮政专用机械及器材制造","商业、饮食、服务业专用设备制造","社会公共安全设备及器材制造","交通安全及管制专用设备制造","水资源专用机械制造","其他专用设备制造"]);
dsy_cl.add("0_2_24", ["铁路运输设备制造","汽车制造","摩托车制造","自行车制造","船舶及浮动装置制造","航空航天器制造","交通器材及其他交通运输设备制造"]);
dsy_cl.add("0_2_24_0", ["铁路机车车辆及动车组制造","工矿有轨专用车辆制造","铁路机车车辆配件制造","铁路专用设备及器材、配件制造","其他铁路设备制造及设备修理"]);
dsy_cl.add("0_2_24_1", ["汽车整车制造","改装汽车制造","电车制造","汽车车身、挂车的制造","汽车零部件及配件制造","汽车修理"]);
dsy_cl.add("0_2_24_2", ["摩托车整车制造","摩托车零部件及配件制造"]);
dsy_cl.add("0_2_24_3", ["脚踏自行车及残疾人座车制造","助动自行车制造"]);
dsy_cl.add("0_2_24_4", ["金属船舶制造","非金属船舶制造","娱乐船和运动船的建造和修理","船用配套设备制造","船舶修理及拆船","航标器材及其他浮动装置的制造"]);
dsy_cl.add("0_2_24_5", ["飞机制造及修理","航天器制造","其他飞行器制造"]);
dsy_cl.add("0_2_24_6", ["潜水及水下救捞装备制造","交通管理用金属标志及设施制造","其他交通运输设备制造"]);
dsy_cl.add("0_2_25", ["电机制造","输配电及控制设备制造","电线、电缆、光缆及电工器材制造","电池制造","家用电力器具制造","非电力家用器具制造","照明器具制造","其他电气机械及器材制造"]);
dsy_cl.add("0_2_25_0", ["发电机及发电机组制造","电动机制造","微电机及其他电机制造"]);
dsy_cl.add("0_2_25_1", ["变压器、整流器和电感器制造","电容器及其配套设备制造","配电开关控制设备制造","电力电子元器件制造","其他输配电及控制设备制造"]);
dsy_cl.add("0_2_25_2", ["电线电缆制造","光纤、光缆制造","绝缘制品制造","其他电工器材制造"]);
dsy_cl.add("0_2_25_4", ["家用制冷电器具制造","家用空气调节器制造","家用通风电器具制造","家用厨房电器具制造","家用清洁卫生电器具制造","家用美容、保健电器具制造","家用电力器具专用配件制造","其他家用电力器具制造"]);
dsy_cl.add("0_2_25_5", ["燃气、太阳能及类似能源的器具制造","其他非电力家用器具制造"]);
dsy_cl.add("0_2_25_6", ["电光源制造","照明灯具制造","灯用电器附件及其他照明器具制造"]);
dsy_cl.add("0_2_25_7", ["车辆专用照明及电气信号设备装置制造","其他未列明的电气机械制造"]);
dsy_cl.add("0_2_26", ["通信设备制造","雷达及配套设备制造","广播电视设备制造","电子计算机制造","电子器件制造","电子元件制造","家用视听设备制造","其他电子设备制造"]);
dsy_cl.add("0_2_25_0", ["通信传输设备制造","通信交换设备制造","通信终端设备制造","移动通信及终端设备制造","其他通信设备制造"]);
dsy_cl.add("0_2_26_2", ["广播电视节目制作及发射设备制造","广播电视接收设备及器材制造","应用电视设备及其他广播电视设备制造"]);
dsy_cl.add("0_2_26_3", ["电子计算机整机制造","计算机网络设备制造","电子计算机外部设备制造"]);
dsy_cl.add("0_2_26_4", ["电子真空器件制造","半导体分立器件制造","集成电路制造","光电子器件及其他电子器件制造"]);
dsy_cl.add("0_2_26_5", ["电子元件及组件制造","印制电路板制造"]);
dsy_cl.add("0_2_26_6", ["家用影视设备制造","家用音响设备制造","其他电子设备制造"]);
dsy_cl.add("0_2_27", ["通用仪器仪表制造","专用仪器仪表制造","钟表与计时仪器制造","光学仪器及眼镜制造","文化、办公用机械制造","其他仪器仪表的制造及修理"]);
dsy_cl.add("0_2_27_0", ["工业自动控制系统装置制造","电工仪器仪表制造","绘图、计算及测量仪器制造","实验分析仪器制造","试验机制造","供应用仪表及其他通用仪器制造"]);
dsy_cl.add("0_2_27_1", ["环境监测专用仪器仪表制造","汽车及其他用计数仪表制造","导航、气象及海洋专用仪器制造","农林牧渔专用仪器仪表制造","地质勘探和地震专用仪器制造","教学专用仪器制造","核子及核辐射测量仪器制造","电子测量仪器制造","其他专用仪器制造"]);
dsy_cl.add("0_2_27_3", ["光学仪器制造","眼镜制造"]);
dsy_cl.add("0_2_27_4", ["电影机械制造","幻灯及投影设备制造","照相机及器材制造","复印和胶印设备制造","计算器及货币专用设备制造","其他文化、办公用机械制造"]);
dsy_cl.add("0_2_28", ["工艺美术品制造","日用杂品制造","煤制品制造","核辐射加工","其他未列明的制造业"]);
dsy_cl.add("0_2_28_0", ["雕塑工艺品制造","金属工艺品制造","漆器工艺品制造","花画工艺品制造","天然植物纤维编织工艺品制造","抽纱刺绣工艺品制造","地毯、挂毯制造","珠宝首饰及有关物品的制造","其他工艺美术品制造"]);
dsy_cl.add("0_2_28_1", ["制镜及类似品加工","鬃毛加工、制刷及清扫工具的制造","其他日用杂品制造"]);
dsy_cl.add("0_2_29", ["金属废料和碎屑的加工处理","非金属废料和碎屑的加工处理"]);







    dsy_cl.add("0", ["农、林、牧、渔业", "采矿业","制造业"]);

var cl = ["indclass1", "indclass2", "indclass3","indclass4"];
var opt_cl = ["行业第1级分类", "行业第2级分类", "行业第3级分类", "行业第4级分类"];
function setup_cl() {
    for (i = 0; i < cl.length - 1; i++)
        document.getElementById(cl[i]).onchange = new Function("change_cl(" + (i + 1) + ");");
    change_cl(0);
}
